[
    {
        "type": "title",
        "text": "Naruto Isekai CYOA"
    },
    {
        "type": "description",
        "text": "You have been reincarnated into the Naruto universe."
    },
    {
        "type": "points",
        "values": {
            "Stat Points": 15,
            "Strength": 0,
            "Dexterity": 0,
            "Chakra": 0,
            "Intelligence": 0,
            "Luck": 0,
            "Charisma": 0
        },
        "allowNegative": [],
        "attributeRanges": {
            "Strength": {
                "min": 0,
                "max": 10
            },
            "Dexterity": {
                "min": 0,
                "max": 10
            },
            "Chakra": {
                "min": 0,
                "max": 10
            },
            "Intelligence": {
                "min": 0,
                "max": 10
            },
            "Luck": {
                "min": 0,
                "max": 10
            },
            "Charisma": {
                "min": 0,
                "max": 10
            }
        }
    },
    {
        "name": "Game Mode",
        "subcategories": [
            {
                "type": "storyBlock",
                "name": "Select Your World",
                "text": "Choose how closely this Naruto world follows canon.",
                "maxSelections": 1,
                "options": [
                    {
                        "id": "canonMode",
                        "label": "Canon",
                        "description": "The world appears mostly as it does in canon with perhaps a few very minor changes here and there to accommodate the selections made in this document. But by and large, it will be virtually indistinguishable from the world created by Kishimoto.",
                        "cost": {}
                    },
                    {
                        "id": "homebrewMode",
                        "label": "Homebrew",
                        "description": "The world has been noticeably modified in some way. This includes small changes such as aging up the main cast to world-bending changes such as becoming a Naruto/One Piece crossover.",
                        "cost": {}
                    }
                ]
            }
        ]
    },
    {
        "name": "Time and Location",
        "subcategories": [
            {
                "type": "storyBlock",
                "name": "Starting Era",
                "text": "You may choose to arrive at any time, but here are some defined eras to help you decide. You can also optionally take Butterfly Insurance to ensure that your actions in the past don't result in unintended outcomes. So kicking over a random rock won't mean that Hinata is never born.",
                "maxSelections": 1,
                "options": [
                    {
                        "id": "eraSageOfSixPaths",
                        "label": "Sage of Six Paths Era",
                        "description": "From Kaguya's arrival to the death of Hagoromo.",
                        "cost": {}
                    },
                    {
                        "id": "eraWarringStates",
                        "label": "Warring States Era",
                        "description": "From the death of Hagoromo to the formation of Konoha.",
                        "cost": {}
                    },
                    {
                        "id": "eraSanin",
                        "label": "Sanin Era",
                        "description": "From the formation of Konoha to the start of the Third Shinobi War.",
                        "cost": {}
                    },
                    {
                        "id": "eraKakashiGaiden",
                        "label": "Kakashi Gaiden Era",
                        "description": "Any time during the Third Shinobi War.",
                        "cost": {}
                    },
                    {
                        "id": "eraNaruto",
                        "label": "Naruto Era",
                        "description": "From the end of the Third Shinobi War to Naruto becoming Hokage.",
                        "cost": {}
                    },
                    {
                        "id": "eraBoruto",
                        "label": "Boruto Era",
                        "description": "Any time after Naruto becomes Hokage.",
                        "cost": {}
                    }
                ]
            },
            {
                "type": "storyBlock",
                "name": "Location",
                "text": "Select your starting location. You can choose to live anywhere within your location's country, not just in the village itself. If you chose an era where the selected village does not exist, you are instead in the general geographic location of where the country will eventually be. If you do not like any of these locations, you can select your own. Perhaps in the Tailed Beast Temple on Genbu or a country beyond the sea?",
                "maxSelections": 1,
                "options": [
                    {
                        "id": "locKonoha",
                        "label": "Konoha",
                        "description": "Konohagakure, or the 'Village Hidden by Leaves', is the hidden village of the Land of Fire. Konoha is hidden by a forest and is generally seen as the most powerful of the ninja villages. Many Konohagakure ninja specialize in Fire Release techniques.",
                        "cost": {}
                    },
                    {
                        "id": "locKumo",
                        "label": "Kumo",
                        "description": "Kumogakure, or the 'Village Hidden by Clouds', is the hidden village of the Land of Lightning. Kumo is hidden in a cloudy range of tall mountains. Many Kumogakure ninja use Lightning Release techniques.",
                        "cost": {}
                    },
                    {
                        "id": "locIwa",
                        "label": "Iwa",
                        "description": "Iwagakure, or the 'Village Hidden by Rocks', is the hidden village of the Land of Earth. Iwa is hidden in a rocky mountain range. Many Iwagakure ninja use Earth Release techniques.",
                        "cost": {}
                    },
                    {
                        "id": "locSuna",
                        "label": "Suna",
                        "description": "Sunagakure, or 'Village Hidden by Sand', is the hidden village of the Land of Wind. Suna is hidden by the shifting desert sands. Many Sunagakure ninja are puppet masters or use Wind Release techniques.",
                        "cost": {}
                    },
                    {
                        "id": "locKiri",
                        "label": "Kiri",
                        "description": "Kirigakure, or the 'Village Hidden by Mist', is the hidden village of the Land of Water. Kiri is hidden by a thick mist and mountains. Many Kiri ninja use Water Release techniques.",
                        "cost": {}
                    },
                    {
                        "id": "locAme",
                        "label": "Ame",
                        "description": "Amegakure, or the 'Village Hidden by Rain', is a small but highly industrialized hidden village located in an unnamed country that is always blanketed by clouds and heavy rain.",
                        "cost": {}
                    },
                    {
                        "id": "locOto",
                        "label": "Oto",
                        "description": "Otogakure, or the 'Village Hidden by Sound', is the personal village of Orochimaru in the Land of Sound, formerly known as the Land of Rice Fields before it was conquered by Orochimaru.",
                        "cost": {}
                    },
                    {
                        "id": "locLandOfIron",
                        "label": "Land of Iron",
                        "description": "The Land of Iron is an icy, snow-covered country located among three mountains. Unlike other countries of the world whose militaries use ninja, the Land of Iron's military is made up of samurai.",
                        "cost": {}
                    },
                    {
                        "id": "locSageLands",
                        "label": "Sage Lands",
                        "description": "The various lands belonging to the different animal summons. While these lands are accessible by foot via secret paths, most people can only find them when reverse summoned by one of the inhabitants.",
                        "cost": {}
                    }
                ]
            }
        ]
    },
    {
        "name": "Attributes",
        "subcategories": [
            {
                "type": "storyBlock",
                "name": "Stat Allocation",
                "text": "Distribute your 15 stat points across your core attributes. Each attribute ranges from 0 to 10.",
                "options": [
                    {
                        "id": "strengthAttribute",
                        "label": "Strength",
                        "description": "Determines raw power output, speed, carrying capacity, and durability.\n0 - Far below average civilian physique; bruise easily.\n1 - Average civilian strength and toughness.\n2 - Genin-tier physicality; comparable to an athlete and can take a punch.\n3 - Chunin-tier physique; peak human and can withstand several blows.\n4 - Special Jonin-tier; beyond peak human, shrug off dozens of hits.\n5 - Jonin-tier; punch through trees and endure being slammed through one.\n6 - Kage-tier; break thick stone walls and keep fighting.\n7 - High-end Kage; shatter massive boulders without slowing down.\n8 - Bijuu-tier; level buildings in a single blow and survive the same.\n9 - Juubi-tier; deliver or tank country-ending strikes.\n10 - Otsutsuki-tier; cleave the moon and withstand moon-splitting attacks.",
                        "inputType": "slider",
                        "min": 0,
                        "max": 10,
                        "costPerPoint": {
                            "Stat Points": 1,
                            "Strength": -1
                        }
                    },
                    {
                        "id": "dexterityAttribute",
                        "label": "Dexterity",
                        "description": "Determines reflexes, speed, and overall agility.\n0 - Far below civilian speed; fumble weapons and self-injure.\n1 - Average civilian quickness; basic kunai handling with poor accuracy.\n2 - Genin-tier dexterity; wield basic weapons and hit visible targets.\n3 - Chunin-tier; proficient with specialized weapons and moving targets.\n4 - Special Jonin-tier; move faster than civilians can see and dodge most attacks you notice.\n5 - Jonin-tier; strike unseen targets with trick throws and match Kakashi-level reactions.\n6 - Kage-tier; Gai-level speed, blitz nearly all sub-Jonin foes.\n7 - High-end Kage; Minato-level speed, among the fastest humans alive.\n8 - War-arc Naruto-tier; instinctively dodge even unseen assaults.\n9 - Hokage Naruto-tier; outpace anyone lacking Otsutsuki heritage.\n10 - Isshiki Otsutsuki-tier; blitz most other Otsutsuki.",
                        "inputType": "slider",
                        "min": 0,
                        "max": 10,
                        "costPerPoint": {
                            "Stat Points": 1,
                            "Dexterity": -1
                        }
                    },
                    {
                        "id": "chakraAttribute",
                        "label": "Chakra",
                        "description": "Determines endurance, chakra reserves, and life force.\n0 - Crippled coils; cannot project chakra and tire after 5 minutes of exertion.\n1 - Civilian pool; 5 E-rank jutsu or 30 minutes of strain exhaust you.\n2 - Genin pool; 5 D-rank jutsu, 2 hours of strain.\n3 - Chunin pool; 5 C-rank jutsu, 5 hours of strain.\n4 - Special Jonin pool; 5 B-rank jutsu, 8 hours of strain.\n5 - Jonin pool; 5 A-rank jutsu, 12 hours of strain.\n6 - Kage pool; 5 S-rank jutsu, 24 hours of strain.\n7 - High-end Kage pool; only city-scale jutsu sap you, 3 days of strain.\n8 - Bijuu pool; country-scale jutsu, 1 week of strain.\n9 - Juubi pool; world-scale jutsu required, practically tireless.\n10 - Otsutsuki with chakra fruit; multiple world-scale jutsu needed to exhaust you.",
                        "inputType": "slider",
                        "min": 0,
                        "max": 10,
                        "costPerPoint": {
                            "Stat Points": 1,
                            "Chakra": -1
                        }
                    },
                    {
                        "id": "intelligenceAttribute",
                        "label": "Intelligence",
                        "description": "Determines learning talent, battle IQ, and chakra control. High or extreme effort lets you learn 1-2 ranks above the listed caps.\n0 - Far below average; poor memory, need high effort for E-rank, abysmal control.\n1 - Average mind; E-rank learned with effort, 20% chakra control.\n2 - Slightly above average; E-rank easy, D-rank with effort, 40% control.\n3 - Moderately above average; D-rank easy, C-rank with effort, 60% control.\n4 - Near-genius; C-rank easy, B-rank with effort, 80% control.\n5 - Exceptional processing; B-rank easy, A-rank with effort, perfect control.\n6 - Eidetic recall; A-rank easy, S-rank with effort.\n7 - Vast knowledge; learn S-rank easily, craft B-rank with effort.\n8 - Inventive prodigy; create B-rank easily, design A-rank with effort.\n9 - Master strategist; craft A-rank easily, shape S-rank with effort.\n10 - Transcendent planner; improvise and enhance S-rank techniques instantly.",
                        "inputType": "slider",
                        "min": 0,
                        "max": 10,
                        "costPerPoint": {
                            "Stat Points": 1,
                            "Intelligence": -1
                        }
                    },
                    {
                        "id": "luckAttribute",
                        "label": "Luck",
                        "description": "Determines fortune in life, missions, and wealth; seldom direct in combat but shapes circumstances.\n0 - Calamitous luck; destined for titles like 'Legendary Sucker'.\n1 - Average luck; outcomes balance between good and bad.\n2 - Slightly lucky; small gambling profits at even odds.\n3 - Fortunate life; random tragedy rarely strikes you or loved ones.\n4 - Noticeably lucky; profit even with modestly unfavorable odds.\n5 - Serendipitous; challenges match your skills and allies arrive when needed.\n6 - Winning streak star; most games favor you and casinos eye you warily.\n7 - Fortuity as teacher; every hardship yields growth and rewards.\n8 - Storybook luck; stumble upon treasures weekly and win lotteries monthly.\n9 - Luck aura; allies avoid permanent harm unless you will otherwise.\n10 - Fate bends; you secure desired outcomes even against cheaters.",
                        "inputType": "slider",
                        "min": 0,
                        "max": 10,
                        "costPerPoint": {
                            "Stat Points": 1,
                            "Luck": -1
                        }
                    },
                    {
                        "id": "charismaAttribute",
                        "label": "Charisma",
                        "description": "Determines physical appeal, communication skill, and likeability.\n0 - Socially and physically off-putting to most.\n1 - Unremarkable; easy to overlook but not offensive.\n2 - Pleasant; people approach you more readily and conversation flows.\n3 - Charming; friendships form easily and small lies fool the unwary.\n4 - Attractive; romantic interest is frequently initiated or reciprocated.\n5 - Magnetic; authority figures overlook minor faults and grant chances.\n6 - Glamorous; attract devoted admirers and romance comes effortlessly.\n7 - Compelling; sway the vulnerable to obey and deceive even the suspicious.\n8 - Disarming; talk foes down mid-fight and maintain impossible good looks.\n9 - Diplomatic legend; broker peace among bitter enemies and master politics.\n10 - Irresistible; inspire obsession and near-unconditional loyalty.",
                        "inputType": "slider",
                        "min": 0,
                        "max": 10,
                        "costPerPoint": {
                            "Stat Points": 1,
                            "Charisma": -1
                        }
                    }
                ]
            }
        ]
    }
]
